CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/ЭлементыОписания/ЭлементыОписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыОписания</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Описания</owners>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>EnumRef.ТипыЭлементовОписания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПростогоОписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВыводитьОписаниеСвойствОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВыводитьОписаниеГруппСвойств</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньЗаголовка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/Enums/ТипыЭлементовОписания/ТипыЭлементовОписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовОписания</name>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбъектаФормата</name>
  </enumValues>
  <enumValues>
    <name>Заголовок</name>
  </enumValues>
</mdclass:Enum>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/ЭлементыОписания/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.ТипЭлемента <> Перечисления.ТипыЭлементовОписания.ОписаниеОбъектаФормата Тогда
		ТекстОписания = Объект.Ссылка.ТекстПростогоОписания.Получить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СкопироватьОформлениеЗаголовка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|Наименование
	|ИЗ Справочник.ОбъектыФормата
	|ГДЕ НЕ ПометкаУдаления И Владелец.Наименование = &НаименованиеВерсии";
	Запрос.УстановитьПараметр("НаименованиеВерсии", СокрЛП(Объект.Владелец.НомерВерсииФормата));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ОбъектФормата.СписокВыбора.Добавить(Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ТипЭлемента <> Перечисления.ТипыЭлементовОписания.ОписаниеОбъектаФормата Тогда
		ХранилищеФорматированногоДокумента = Новый ХранилищеЗначения(ТекстОписания);
		ТекущийОбъект.ТекстПростогоОписания = ХранилищеФорматированногоДокумента;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьДоступность();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЭлементаПриИзменении(Элемент)
	ОбновитьВидимостьДоступность();
	СкопироватьОформлениеЗаголовка();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	ОписаниеОбъектаФормата = (Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата"));
	Элементы.ГруппаСтраницаОписание.Доступность = НЕ ОписаниеОбъектаФормата;
	Элементы.ГруппаОбъектФормата.Видимость = ОписаниеОбъектаФормата;
	Элементы.УровеньЗаголовка.Видимость = (Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.Заголовок"));
КонецПроцедуры

&НаСервере
Процедура СкопироватьОформлениеЗаголовка()
	Если Объект.ТипЭлемента <> Перечисления.ТипыЭлементовОписания.Заголовок Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОбразец Из Объект.Владелец.ОформлениеЗаголовков Цикл
		Если СтрокаОбразец.Уровень = Объект.УровеньЗаголовка Тогда
			ТекстОписания = СтрокаОбразец.ОбразецОформления.Получить();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОбъектФорматаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектФормата) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъектФормата = ПолучитьСсылкуНаОбъектФормата(Объект.ОбъектФормата, Объект.Владелец);
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъектФормата) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ОбъектыФормата.Форма.ФормаЭлемента", Новый Структура("Ключ", СсылкаНаОбъектФормата));
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаОбъектФормата(ИмяОбъектФормата, ОписаниеСсылка)
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|Ссылка
	|ИЗ Справочник.ОбъектыФормата
	|ГДЕ НЕ ПометкаУдаления И Владелец.Наименование = &НаименованиеВерсии
	|	И Наименование = &НаименованиеОбъекта";
	Запрос.УстановитьПараметр("НаименованиеВерсии", СокрЛП(ОписаниеСсылка.НомерВерсииФормата));
	Запрос.УстановитьПараметр("НаименованиеОбъекта", СокрЛП(ИмяОбъектФормата));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
#КонецОбласти
